In [2]:
customer_data = [
    [1, 'Ella', 'emily@example.com'],
    [2, 'David', 'michael@example.com'],
    [3, 'Zachary', 'sarah@example.com'],
    [4, 'Alice', 'john@example.com'],
    [5, 'Finn', 'john@example.com'],
    [6, 'Violet', 'alice@example.com']
]

In [4]:
customer_data_columns = ['customer_id', 'name', 'email']

In [6]:
import pandas as pd

In [8]:
df = pd.DataFrame(data=customer_data, columns=customer_data_columns)

In [10]:
df

   customer_id     name                email
0            1     Ella    emily@example.com
1            2    David  michael@example.com
2            3  Zachary    sarah@example.com
3            4    Alice     john@example.com
4            5     Finn     john@example.com
5            6   Violet    alice@example.com

In [18]:
df['email']

0      emily@example.com
1    michael@example.com
2      sarah@example.com
3       john@example.com
4       john@example.com
5      alice@example.com
Name: email, dtype: object

In [20]:
df.drop_duplicates(subset='email', inplace=True)

In [22]:
df

   customer_id     name                email
0            1     Ella    emily@example.com
1            2    David  michael@example.com
2            3  Zachary    sarah@example.com
3            4    Alice     john@example.com
5            6   Violet    alice@example.com

.drop_duplicates() removes the rows with repeated occurences of a value, takes in the subset= and inplace=True will make sure that the filtering happens on your original table

In [25]:
student_data = [
    [1, 'Ella', 'emily@example.com'],
    [2, 'David', 'michael@example.com'],
    [3, None, 'sarah@example.com'],
    [4, 'Alice', 'john@example.com'],
    [5, None, 'john@example.com'],
    [6, 'Violet', 'alice@example.com']
]

In [27]:
student_data_columns = ['student_id', 'name', 'email']

In [31]:
df2 = pd.DataFrame(data=student_data, columns=student_data_columns)

In [33]:
df2

   student_id    name                email
0           1    Ella    emily@example.com
1           2   David  michael@example.com
2           3    None    sarah@example.com
3           4   Alice     john@example.com
4           5    None     john@example.com
5           6  Violet    alice@example.com

In [37]:
df2.dropna(subset='name', inplace=True)

In [39]:
df2

   student_id    name                email
0           1    Ella    emily@example.com
1           2   David  michael@example.com
3           4   Alice     john@example.com
5           6  Violet    alice@example.com

.dropna() used to remove the rows that have no values for a certain column. It takes the same arguments as .dropduplicates(), takes a subset= and inplace=True

if you want to drop empty values for more than one column, write the subset as a list: subset=['name','email']

In [44]:
salary_data = [
    ['Jack', 20000],
    ['Piper', 75000],
    ['Mia', 60000],
    ['Ulysses', 55000]
]

In [48]:
df3 = pd.DataFrame(data=salary_data, columns=['name', 'salary'])

In [50]:
df3

      name  salary
0     Jack   20000
1    Piper   75000
2      Mia   60000
3  Ulysses   55000

focus in on the salary column,
double each value in each row,
update the salary column with the doubled salary

In [53]:
df3['salary'] = df3['salary'] * 2

In [55]:
df3

      name  salary
0     Jack   40000
1    Piper  150000
2      Mia  120000
3  Ulysses  110000

Updating existing values of a column: we access the row values for 'salary' and multiply it by 2, we set this new computation as the new row value for 'salary'

In [59]:
names_data = [
    [1, 'Ella', 'emily@example.com'],
    [2, 'David', 'michael@example.com'],
    [3, 'Zachary', 'sarah@example.com'],
    [4, 'Alice', 'john@example.com'],
    [5, 'Finn', 'john@example.com'],
    [6, 'Violet', 'alice@example.com']
]

In [61]:
names_data_columns = ['id', 'first', 'email']

In [63]:
df4 = pd.DataFrame(data=names_data, columns=names_data_columns)

In [65]:
df4

   id    first                email
0   1     Ella    emily@example.com
1   2    David  michael@example.com
2   3  Zachary    sarah@example.com
3   4    Alice     john@example.com
4   5     Finn     john@example.com
5   6   Violet    alice@example.com

In [67]:
df4.rename(columns={
    'id': 'student_id',
    'first': 'first_name',
    'email': 'email_address'
})

   student_id first_name        email_address
0           1       Ella    emily@example.com
1           2      David  michael@example.com
2           3    Zachary    sarah@example.com
3           4      Alice     john@example.com
4           5       Finn     john@example.com
5           6     Violet    alice@example.com

.rename() renames the column names for your table. It takes a variable called columns= where you can provide a mapping between old column name and new column name.

In [70]:
df4.dtypes

id        int64
first    object
email    object
dtype: object